{
"If you come across a phrase that have two(or more) meanings in diffrent situation, you can name the secondary meanings with a new name, and add 'data-lang=\"theNewName\"' label where you want the text to be replaced with the another meaning.": "如果你碰到了一个短语（句子）拥有两种或更多的意思，你可以额外使用一个新名称来命名第二种意思，然后在你想用第二种意思翻译这个短语的时候，你就在它的标签上添加’data-lang=\"新名称\"‘来实现想要的效果。",
"A movie name": "一部电影的名称",
"Happiness__second": "幸福这个词",
"Happiness": "幸福",
"A felling of delight": "一种开心的情绪",
"Just like this:": "就像这样：",
"Configure b28Cfg to customize translate style of your own.": "配置b28Cfg来定制你想要的翻译方式。",
": If you want to switch language on the web page, just add a select element with id 'select-lang' and enable this config. You can also use": "：如果你想在页面上增加一个切换语言的选择框，只需要在页面上增加一个id为‘select-lang'的select然后启用此配置。你也可以使用",
"and then reload the page if necessary to change language on your own way.": "，然后重新加载页面，就可以实现其它的自定义效果。",
": Replace the node-value with html text instead of plain text, we disabled it by default.": "：使用innerHTML代替innerText进行文本替换。",
": Trim the text-node value before match the translation.": "：在匹配翻译文字前对文本节点值进行trim操作。",
": True means you choose to use the text node it self as the anchor to match the translation, while false means you add a \"data-lang='value'\" label for every translated node as a translation anchor, and using 'value' to match translation. Only add \"data-lang\" label to element node and when you do that b28new.js won't traverse it's childern nodes any more, so be careful with it.": "：True代表你选择使用文本节点本身作为翻译的锚点，false代表你给每个要翻译节点都加上了data-lang属性，并使用data-lang属性的值来作为替换锚点对此节点的内容进行替换，请注意，当你这样做时，b28new.js不会遍历具有此属性的节点的子节点。",
": Set the file type of translatin pakeges.": "：设置语言包的文件格式。",
": Set a default language to show the page.": "：设置页面默认以某种语言显示。",
": Only language in the support array can be shown in the web pages, make sure you have every supported language translated.": "：只有在支持数组中的语言才能显示在页面上，请确保你列举的支持语言都已经被翻译了。",
"Use": "使用",
"without set a definite language, the script will aotomatic set a language for you. Language set in cookie have the highest priority, the cookie name is 'bLanguage'. The navigator language will be consider secondly. And if we don't have cookie named with 'bLanguage' or cookie language as well as navigator language is not in support list, we'll use the default language to show the pages.": "如果你没有指定语言，脚本会自动设置一个语言。首先脚本会检测cookie中是否有名为bLanguage的条目，如果有，就尝试用它的值作为默认语言，如果不存在，则尝试使用浏览器语言作为默认语言。如果这两者都没有，或者它们都不在支持的语言列表之中，就会使用脚本中预定义的语言来显示页面。",
"We've got some helpful tips for you here:": "我们有几个有用的小秘诀：",
"Do it better with b28new": "更好地使用b28new.js",
"JSON in Excel": "存储在Excel中的JSON风格的文件",
"xml opened in Excel as xml file": "xml文件在Excel中以xml方式打开",
"Ok, After finished the debug, you might think it's time to declare mission accomplished, but I have to remind you the tranlation may not be perfect, do take care about the style for translation text may be much longer(or shorter) than the before.": "当完成debug后，你也许会觉得翻译已经完成了，但是我不得不提醒你，你还需要关注文字长度这个棘手的的问题，并适度调整一下css。",
"Put the JSON or xml file in the lang folder. And add a script": "",
"in the html right after": "",
"Then try to open your work on browser to see if the translate works. The number of bugs might beyond your expectations, but don't worry, it'll be much better next time.": "然后试试用浏览器打开你的杰作看看有没有翻译成功。如果遇到了很多bug，不要沮丧，慢慢调试就好了，熟能生巧，以后几次就会变好的。",
"About the text in javascript file, you need to translate them with function \"_\" like this:": "关于js文件里面的文字，你需要使用“_”函数来翻译他们，就像这样：",
"Yes, you can also try it out to arrange the JSON file in this way by hand and share your feelings with us, for we've never done that before. Oh, don't forget to escape ' \" ' and ' \\ ' or you won't like to see the translate result.": "嗯，你也可以尝试手工将翻译文字组织成JSON格式，然后向我们讲述你的趣闻。别忘了将“ \" ”和“ \\ ”进行转义，否则将出现你不想看到的结果。",
"If you want your language packet organized in the form of JSON, you should choose excel(Use Microsoft Excel 2007 or higher version) as carrier of translation, and use language as column title. You can also add an extra column for JSON as \"msgid\" when you don't want use the translated text itself as translate anchor, then you should have the text wrapped with an element tag and add a data-lang=\"msgid\" attribute on it. We have a automatic tool in perl named \"JSONParser\" in folder \"automaticTool\" to parse excel file you can read the \"readme\" document to get start. The output file looks like this:": "如果你想用JSON来组织你的翻译文字，你应该选择Excel（请使用Excel2007或以上版本）来存放文件，然后把每栏的第一行写成对应的语言名称。当你不想使用要翻译文字本身作为翻译锚点的话，你可以额外添加一栏作为信息ID。这样的话，翻译文字两边必须被一个标签包裹，并且标签上需要一个 data-lang=\"msgid\" 属性来作为翻译的锚点。我们在“automaticTool”文件夹下放置了一个perl工具用于将Excel文件转换成JSON（作者：林光），但是这个工具只能装在Linux下，你可以阅读readme.txt去学习如何使用。输出文件格式如下所示：",
"xml in excel": "xml文件在Excel中打开",
"But the xml style is not recommend, for it have to use redundant tags and the speed of translation is slower than JSON style.": "但我们不推荐使用xml方式，因为它需要额外的标签来表示信息，并且，它的解析速度要慢于JSON.。",
"If you want to carrier translation with xml file, format your file like this:": "如果你要用xml文件来存放翻译文字，确保你的xml格式和下面一样：",
"After you finished pick-up, for the convenience of translators, we suggest that you put all the text that need to be translated in a excel or xml file like this:": "在你做完文字提取工作之后，为了翻译人员的方便，我们建议你将要翻译的文字全部像下面一样放到Excel或者xml中：",
"Do translate": "进行翻译",
"Well, we used to do the pick-up job all by hand, and that's quite funny experience, I was serious.": "囧，我们以前提取页面文件都是纯手工作业，那是一段非常愉快的经历，我绝对没有骗你。",
"We have a tool name \"textPicker\" to help you with rough pick up, and you may fix the flaws afterwards. You can find it and a brief readme text in folder \"automaticTool\".": "我们编写了一个名为“textPicker”的工具来帮助你进行粗略的提取，你可以在稍后对提取结果进行修补。工具在名为“automaticTool”的文件夹中。",
"Pick up text in the html and javascript files": "从html文件和js文件中提取翻译文字",
"If you use ajaxLoad to fill a section, don't forget to translate it use:": "如果你使用了AjaxLoad去填充网页中的某一块，别忘了使用以下语句对这一块进行翻译：",
"If there is a frame in your translate page, don't set the frame's src until top window's domready to avoid some unexpected errors.": "如果你要翻译的网页中有frame，为了防止翻译出现部分失效，请在此网页DOM加载完成后在设置frame的src属性。",
"You'd better put b28new.js before all the js that might change the Document incase translate failed.": "最好将b28new.js放置到所有可能引起DOM变化的js文件之前。",
"Make sure you put b28new.js in the same folder with language files, or you need to modify it to ensure loading language files properly.": "确保将b28new.js放置到和语言包文件相同的目录下，否则你必须修改它以使它能够正确加载语言包文件到网页中。",
"Note:": "注意：",
"First, found a folder to place b28new.js as well as your language files, I create a folder named 'lang' in the same root with the html file to place it. Then import b28new.js to your html files like this:": "首先，找到一个文件夹来放置b28new.js和语言包文件，我在网页文件目录下新建了一个名为“lang”的文件夹来放置它们。然后向下面这样将库文件引入你的网页文件：",
"Import b28new.js to your html files": "将 b28new.js 引入你的网页文件",
"How to Use": "如何使用",
"is a lib that ET.w written for pruduct web pages translation.": "是一个ET.w团队为了产品网页的翻译而写的库。",
"origin__b28n": "网上很早之前就有了一个叫做<em title=\"Butterfat internationalization\">“b28n.js”</em>的翻译库文件，作者是<a title=\"bmuller@buttterfat.net\" href=\"#\">bmuller </a>",
"and we refer to it's realization at the first version, so that's why we name this lib with b28new. The lib has been proved to be robust and compatible with allmost all the modern browser as well as ie7 & ie8. Hope that it's helpful!": "，我们的第一版参照了它的实现，因此我们将这个翻译库命名为“b28new.js”。b28new.js 经过了我们的不断修改，已经被证实是足够健壮且兼容性良好的，它能够兼容几乎所有的现代浏览器，当然也包括ie7 和 ie8。希望它对你的翻译工作有帮助！",
"Introducing b28new.js": "b28new.js 使用文档",
"Introduction to b28new.js": "b28new.js 简介",
"how_to_translate":"把JSON或xml语言包文件放在lang文件夹下，然后在要翻译的html文件中引入b28new.js的位置 <code>&lt;script src=\"lang/b28new_3.0.0.js\"&gt;&lt;/script&gt;</code> 的后面加上类似下面的代码：<code>B.setTextDomain([\"languagePacketFile1\", \"languagePacketFile2\"], language);</code>。",
"If you find some sentece divided into several blocks by html tags, and which is impossible to translate  word by word, you can wrapped the sentence with a inline tag, and trun \"data-lang\" attribute for help. Diffrent from tips 3, you need to set b28Cfg.insertHTML to \"true\" this time.":"如果你发现一句话被html标签分成了若干段，而且无法逐字翻译，这时你就可以使用 “data-lang”标签来进行翻译，不同于第三个提示的是，这次你需要将b28Cfg.insertHTML的值变为 true。",
". And you may use it this way:":"。你也可以像这样使用：",
", \"%s\" will be replace by the given arguments.":", \"%s\" 将被替换成给定的参数。"
}